models/Slider.php

SELECT MIN(ordering) FROM `tbl_slider` WHERE (`cid`=1) AND (`langs`='thai')
---
    public function orderMax($langs = null, $cid = null) {
        if ($langs == null)
            $langs = 'thai';
        $query = Slider::find()->where(['cid' => $cid, 'langs' => $langs])->max('ordering');