models/TblAmphur.php

    public function makeDropDown() {
        global $data;
        $data = array();
        $parents = TblAmphur::find()->all();
---
SELECT * FROM `tbl_amphur`